kevinboenisch/rp2040-serial-bootloader/main.c
/**
 * Copyright (c) 2021 Brian Starkey <stark3y@gmail.com>
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdio.h>
#include <string.h>

#include "version.h"
#include "config.h"
#include "core1.h"
#include "oled.h"
#include "oled_indicators.h"

#include "RP2040.h"
#include "pico/time.h"
#include "hardware/dma.h"
#include "hardware/flash.h"
#include "hardware/structs/dma.h"
#include "hardware/structs/watchdog.h"
#include "hardware/gpio.h"
#include "hardware/resets.h"
#include "hardware/uart.h"
#include "hardware/watchdog.h"

#include "pico/stdlib.h"
#include "pico/bootrom.h"
#include "pico/time.h" // Perf measurement

#include "jpo/jcomp/jcomp_protocol.h"
#include "jpo/jcomp/jcomp_brain.h"
#include "jpo/jcomp/debug.h"

#include "stdalign.h"

// Test write delay. Write command runs in parallel with
// store, so this could affect timing.
#define TEST_WRITE_DELAY_MS 0
#define TEST_CORRUPT_BEFORE_VERIFY 0 // Set to >=2... not 1
#define TEST_CORRUPT_AFTER_VERIFY  0 // Set to >=2... not 1

// Debug enable/disable
#define T_BOOT 0 // "boot"
#define T_TIME "time" // time output at the end of the bootloader. not much overhead, keep enabled.

// The bootloader can be entered in three ways:
//  - BOOTLOADER_ENTRY_PIN is low
//  - Watchdog scratch[5] == BOOTLOADER_ENTRY_MAGIC && scratch[6] == ~BOOTLOADER_ENTRY_MAGIC
//  - No valid image header
#define BOOTLOADER_ENTRY_PIN 15
#define BOOTLOADER_ENTRY_MAGIC 0xb105f00d

#define UART_TX_PIN 0
#define UART_RX_PIN 1
#define UART_BAUD   921600

#define CMD_READ   (('R' << 0) | ('E' << 8) | ('A' << 16) | ('D' << 24))
#define CMD_CSUM   (('C' << 0) | ('S' << 8) | ('U' << 16) | ('M' << 24))
#define CMD_CRC    (('C' << 0) | ('R' << 8) | ('C' << 16) | ('C' << 24))
#define CMD_ERASE  (('E' << 0) | ('R' << 8) | ('A' << 16) | ('S' << 24))
#define CMD_STORE  (('S' << 0) | ('T' << 8) | ('O' << 16) | ('R' << 24)) // jpo
#define CMD_COPY_STORED (('C' << 0) | ('P' << 8) | ('S' << 16) | ('T' << 24)) // jpo
#define CMD_ERASE_WRITE (('E' << 0) | ('R' << 8) | ('W' << 16) | ('R' << 24)) // jpo
#define CMD_SEAL   (('S' << 0) | ('E' << 8) | ('A' << 16) | ('L' << 24))
#define CMD_GO     (('G' << 0) | ('O' << 8) | ('G' << 16) | ('O' << 24))
#define CMD_INFO   (('I' << 0) | ('N' << 8) | ('F' << 16) | ('O' << 24))

#define RSP_OK       (('O' << 0) | ('K' << 8) | ('O' << 16) | ('K' << 24))
#define RSP_ERR      (('E' << 0) | ('R' << 8) | ('R' << 16) | ('!' << 24))
#define RSP_ERR_CRC  (('C' << 0) | ('R' << 8) | ('C' << 16) | ('!' << 24))
#define RSP_NO_RESP (0)

// Bootloader error as a JCOMP_RV value
#define JCOMP_ERR_BOOTLOADER (JCOMP_ERR_CLIENT + 1)

#define IMAGE_HEADER_OFFSET (BOOTLOADER_SIZE_KB * 1024)

#define WRITE_ADDR_MIN (XIP_BASE + IMAGE_HEADER_OFFSET + FLASH_SECTOR_SIZE)
#define ERASE_ADDR_MIN (XIP_BASE + IMAGE_HEADER_OFFSET)
#define FLASH_ADDR_MAX (XIP_BASE + PICO_FLASH_SIZE_BYTES)

// Maximum size in JCOMP, minus bytes for the opcode/addr/len args
#define MAX_DATA_LEN (JCOMP_MAX_PAYLOAD_SIZE - 12)

// Perf improvement: noack support
static bool _last_msg_noack = false;

// Page data to write, 4k in size
// Optimization: initialize in main() to keep it in RAM (top of the stack) instead of the binary (flash)
static uint8_t* _write_flash_sector = NULL;

// Perf measurement
static uint32_t _start_ms = 0;
static uint32_t _flash_total_ms = 0;
static uint32_t time_ms()
{
	return to_ms_since_boot(get_absolute_time());
}


static void disable_interrupts(void)
{
	SysTick->CTRL &= ~1;

	NVIC->ICER[0] = 0xFFFFFFFF;
	NVIC->ICPR[0] = 0xFFFFFFFF;
}

static void reset_peripherals(void)
{
    reset_block(~(
            RESETS_RESET_IO_QSPI_BITS |
            RESETS_RESET_PADS_QSPI_BITS |
            RESETS_RESET_SYSCFG_BITS |
            RESETS_RESET_PLL_SYS_BITS
    ));
}

static void jump_to_vtor(uint32_t vtor)
{
	// Derived from the Leaf Labs Cortex-M3 bootloader.
	// Copyright (c) 2010 LeafLabs LLC.
	// Modified 2021 Brian Starkey <stark3y@gmail.com>
	// Originally under The MIT License
	uint32_t reset_vector = *(volatile uint32_t *)(vtor + 0x04);

	SCB->VTOR = (volatile uint32_t)(vtor);

	asm volatile("msr msp, %0"::"g"
			(*(volatile uint32_t *)vtor));
	asm volatile("bx %0"::"r" (reset_vector));
}

static uint32_t size_read(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out);
static uint32_t handle_read(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t size_csum(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out);
static uint32_t handle_csum(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t size_crc(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out);
static uint32_t handle_crc(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_erase(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_copyStoredPage(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_eraseWritePage(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_seal(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_go(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
static uint32_t handle_info(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);

struct command_desc {
	uint32_t opcode;
	uint32_t nargs;
	uint32_t resp_nargs;
	uint32_t (*size)(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out);
	uint32_t (*handle)(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out);
};

const struct command_desc cmds[] = {
	{
		// READ addr len
		// OKOK [data]
		.opcode = CMD_READ,
		.nargs = 2,
		.resp_nargs = 0,
		.size = &size_read,
		.handle = &handle_read,
	},
	{
		// CSUM addr len
		// OKOK csum
		.opcode = CMD_CSUM,
		.nargs = 2,
		.resp_nargs = 1,
		.size = &size_csum,
		.handle = &handle_csum,
	},
	{
		// CRCC addr len
		// OKOK crc
		.opcode = CMD_CRC,
		.nargs = 2,
		.resp_nargs = 1,
		.size = &size_crc,
		.handle = &handle_crc,
	},
	{
		// ERAS addr len
		// OKOK
		.opcode = CMD_ERASE,
		.nargs = 2,
		.resp_nargs = 0,
		.size = NULL,
		.handle = &handle_erase,
	},
	{
		// STOR addr len [data]
		// OKOK crc (of the 4k storage buffer)
		.opcode = CMD_STORE,
		.nargs = 2,
		.resp_nargs = 1,
		.size = NULL,
		.handle = NULL,
	},
	{
		// CPST
		// OKOK crc (of the in-memory page to be written)
		.opcode = CMD_COPY_STORED,
		.nargs = 0,
		.resp_nargs = 1,
		.size = NULL,
		.handle = &handle_copyStoredPage,
	},
	{
		// ERWR addr len progress (0-100)
		// OKOK crc (of the written page)
		// ERR! if erase fails
		.opcode = CMD_ERASE_WRITE,
		.nargs = 3,
		.resp_nargs = 1,
		.size = NULL,
		.handle = &handle_eraseWritePage,
	},
	{
		// SEAL vtor len crc
		// OKOK
		.opcode = CMD_SEAL,
		.nargs = 3,
		.resp_nargs = 0,
		.size = NULL,
		.handle = &handle_seal,
	},
	{
		// GOGO vtor
		// NO RESPONSE
		.opcode = CMD_GO,
		.nargs = 1,
		.resp_nargs = 0,
		.size = NULL,
		.handle = &handle_go,
	},
	{
		// INFO
		// OKOK flash_start flash_size erase_size write_size max_data_len
		.opcode = CMD_INFO,
		.nargs = 0,
		.resp_nargs = 5,
		.size = NULL,
		.handle = &handle_info,
	},
};
const unsigned int N_CMDS = (sizeof(cmds) / sizeof(cmds[0]));
const uint32_t MAX_NARG = 5;

