kevinboenisch/rp2040-serial-bootloader/main.c
static bool is_error(uint32_t status)
{
	return status == RSP_ERR;
}

static uint32_t size_read(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out)
{
	uint32_t size = args_in[1];
	if (size > MAX_DATA_LEN) {
		return RSP_ERR;
	}

	// TODO: Validate address

	*data_len_out = 0;
	*resp_data_len_out = size;

	return RSP_OK;
}

static uint32_t handle_read(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];

	memcpy(resp_data_out, (void *)addr, size);

	return RSP_OK;
}

static uint32_t size_csum(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out)
{
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];

	if ((addr & 0x3) || (size & 0x3)) {
		// Must be aligned
		return RSP_ERR;
	}

	// TODO: Validate address

	*data_len_out = 0;
	*resp_data_len_out = 0;

	return RSP_OK;
}

static uint32_t handle_csum(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	uint32_t dummy_dest;
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];

	int channel = dma_claim_unused_channel(true);

	dma_channel_config c = dma_channel_get_default_config(channel);
	channel_config_set_transfer_data_size(&c, DMA_SIZE_32);
	channel_config_set_read_increment(&c, true);
	channel_config_set_write_increment(&c, false);
	channel_config_set_sniff_enable(&c, true);

	dma_hw->sniff_data = 0;
	dma_sniffer_enable(channel, 0xf, true);

	dma_channel_configure(channel, &c, &dummy_dest, (void *)addr, size / 4, true);

	dma_channel_wait_for_finish_blocking(channel);

	dma_sniffer_disable();
	dma_channel_unclaim(channel);

	*resp_args_out = dma_hw->sniff_data;

	return RSP_OK;
}

static uint32_t size_crc(uint32_t *args_in, uint32_t *data_len_out, uint32_t *resp_data_len_out)
{
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];

	if ((addr & 0x3) || (size & 0x3)) {
		// Must be aligned
		return RSP_ERR;
	}

	// TODO: Validate address

	*data_len_out = 0;
	*resp_data_len_out = 0;

	return RSP_OK;
}

// ptr must be 4-byte aligned and len must be a multiple of 4
static uint32_t calc_crc32(void *ptr, uint32_t len)
{
	uint32_t dummy_dest, crc;

	int channel = dma_claim_unused_channel(true);
	dma_channel_config c = dma_channel_get_default_config(channel);
	channel_config_set_transfer_data_size(&c, DMA_SIZE_32);
	channel_config_set_read_increment(&c, true);
	channel_config_set_write_increment(&c, false);
	channel_config_set_sniff_enable(&c, true);

	// Seed the CRC calculation
	dma_hw->sniff_data = 0xffffffff;

	// Mode 1, then bit-reverse the result gives the same result as
	// golang's IEEE802.3 implementation
	dma_sniffer_enable(channel, 0x1, true);
	dma_hw->sniff_ctrl |= DMA_SNIFF_CTRL_OUT_REV_BITS;

	dma_channel_configure(channel, &c, &dummy_dest, ptr, len / 4, true);

	dma_channel_wait_for_finish_blocking(channel);

	// Read the result before resetting
	crc = dma_hw->sniff_data ^ 0xffffffff;

	dma_sniffer_disable();
	dma_channel_unclaim(channel);

	return crc;
}

static uint32_t handle_crc(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];

	resp_args_out[0] = calc_crc32((void *)addr, size);

	return RSP_OK;
}


static uint32_t do_erase(uint32_t addr, uint32_t size)
{
	if ((addr < ERASE_ADDR_MIN) || (addr + size > FLASH_ADDR_MAX)) {
		// Outside flash
		return RSP_ERR;
	}

	if ((addr & (FLASH_SECTOR_SIZE - 1)) || (size & (FLASH_SECTOR_SIZE - 1))) {
		// Must be aligned
		return RSP_ERR;
	}

	uint32_t start_ms = time_ms();
	flash_range_erase(addr - XIP_BASE, size);
	_flash_total_ms += time_ms() - start_ms;

	return RSP_OK;
}

static uint32_t handle_erase(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];
	
	return do_erase(addr, size);
}

static void do_write(uint32_t addr, uint32_t size, uint8_t* data_in)
{
	uint32_t start_ms = time_ms();
	flash_range_program(addr - XIP_BASE, data_in, size);
	_flash_total_ms += time_ms() - start_ms;
}

static uint32_t handle_copyStoredPage(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{	
	// Safely copy the stored data
	copy_stored_flash_sector(_write_flash_sector);

#if TEST_CORRUPT_BEFORE_VERIFY >= 2
	static int tbv_counter = 0;
	if (tbv_counter % TEST_CORRUPT_BEFORE_VERIFY == 0 
		|| tbv_counter % TEST_CORRUPT_BEFORE_VERIFY == 1) {
		_write_flash_sector[0] ^= 0x88;
		DBG_SEND(T_WARN, "handle_copyStoredPage: introducing data corruption before verify for testing");
	}
	tbv_counter++;
#endif

	// Return the CRC of stored data that was copied (and is about to be written)
	uint32_t mem_crc = calc_crc32(_write_flash_sector, FLASH_SECTOR_SIZE);
	resp_args_out[0] = mem_crc;	

#if TEST_CORRUPT_AFTER_VERIFY >= 2
	static int tav_counter = 0;
	if (tav_counter % TEST_CORRUPT_AFTER_VERIFY == 0
		|| tav_counter % TEST_CORRUPT_AFTER_VERIFY == 1) {
		_write_flash_sector[0] ^= 0x88;
		DBG_SEND(T_WARN, "handle_copyStoredPage: introducing data corruption after verify for testing");
	}
	tav_counter++;
#endif

	return RSP_OK;
}

static uint32_t handle_eraseWritePage(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	// Erases the page and writes data copied by copyStoredPage. 
	// Assumes that data is correct. 
	uint32_t addr = args_in[0];
	uint32_t size = args_in[1];
	uint32_t progress = args_in[2]; // 0-100
	(void)progress; // unused if OLED_ENABLED is false

	//DBG_SEND(T_BOOT, "handle_eraseWritePage addr: 0x% size: %d progress:%d", addr, size, progress);

	// Bug repro: delay before copy (as this is an async fn)
#if TEST_WRITE_DELAY_MS
	sleep_ms(TEST_WRITE_DELAY_MS);
#endif

	//DBG_SEND(T_BOOT, "erwr do_erase addr: %d size: %d", addr, size);
	uint32_t resp = do_erase(addr, size);
	if (resp != RSP_OK) {
		DBG_SEND(T_ERROR, "handle_eraseWritePage addr: 0x%x size: %d, erase failed.", addr, size);
		return resp;
	}

