kevinboenisch/rp2040-serial-bootloader/main.c
	uint32_t offset = 0;
	while (offset < size)
	{
		uint32_t write_size = FLASH_PAGE_SIZE;
		if (size - offset < FLASH_PAGE_SIZE) {
			write_size = size - offset;
		}

		//DBG_SEND(T_BOOT, "erwr do_write: addr: %d size: %d offset: %d", addr, write_size, offset);
		do_write(addr + offset, write_size, _write_flash_sector + offset);

		offset += write_size;
	}
	
	// return CRC of actual written data (NOT flash_sector_to_write)
	resp_args_out[0] = calc_crc32((void *)addr, size);

#if OLED_ENABLED
	oled_draw_progress_bar(progress);
#endif

	return RSP_OK;
}

struct image_header { 
	uint32_t vtor;
	uint32_t size;
	uint32_t crc;
	uint8_t pad[FLASH_PAGE_SIZE - (3 * 4)];
};
static_assert(sizeof(struct image_header) == FLASH_PAGE_SIZE, "image_header must be FLASH_PAGE_SIZE bytes");

static bool image_header_ok(struct image_header *hdr)
{
	uint32_t *vtor = (uint32_t *)hdr->vtor;

	uint32_t calc = calc_crc32((void *)hdr->vtor, hdr->size);

	// CRC has to match
	if (calc != hdr->crc) {
		return false;
	}

	// Stack pointer needs to be in RAM
	if (vtor[0] < SRAM_BASE) {
		return false;
	}

	// Reset vector should be in the image, and thumb (bit 0 set)
	if ((vtor[1] < hdr->vtor) || (vtor[1] > hdr->vtor + hdr->size) || !(vtor[1] & 1)) {
		return false;
	}

	// Looks OK.
	return true;
}


static uint32_t handle_seal(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	struct image_header hdr = {
		.vtor = args_in[0],
		.size = args_in[1],
		.crc = args_in[2],
	};

	if ((hdr.vtor & 0xff) || (hdr.size & 0x3)) {
		// Must be aligned
		return RSP_ERR;
	}

	if (!image_header_ok(&hdr)) {
		return RSP_ERR;
	}

	uint32_t start_ms = time_ms();
	flash_range_erase(IMAGE_HEADER_OFFSET, FLASH_SECTOR_SIZE);
	flash_range_program(IMAGE_HEADER_OFFSET, (const uint8_t *)&hdr, sizeof(hdr));
	_flash_total_ms += time_ms() - start_ms;

	struct image_header *check = (struct image_header *)(XIP_BASE + IMAGE_HEADER_OFFSET);
	if (memcmp(&hdr, check, sizeof(hdr))) {
		return RSP_ERR;
	}

	// Perf info
	uint32_t total_ms = time_ms() - _start_ms;
	DBG_SEND(T_TIME, "time (ms): total: %d flash: %d", total_ms, _flash_total_ms);

	return RSP_OK;
}

static uint32_t handle_go(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	disable_interrupts();

	reset_peripherals();

	jump_to_vtor(args_in[0]);

	while(1);

	return RSP_ERR;
}

static uint32_t handle_info(uint32_t *args_in, uint8_t *data_in, uint32_t *resp_args_out, uint8_t *resp_data_out)
{
	_start_ms = time_ms();
	_flash_total_ms = 0;

	resp_args_out[0] = WRITE_ADDR_MIN;
	resp_args_out[1] = (XIP_BASE + PICO_FLASH_SIZE_BYTES) - WRITE_ADDR_MIN;
	resp_args_out[2] = FLASH_SECTOR_SIZE;
	resp_args_out[3] = FLASH_PAGE_SIZE;
	resp_args_out[4] = MAX_DATA_LEN;

	return RSP_OK;
}

static const struct command_desc *find_command_desc(uint32_t opcode)
{
	unsigned int i;

	for (i = 0; i < N_CMDS; i++) {
		if (cmds[i].opcode == opcode) {
			return &cmds[i];
		}
	}

	return NULL;
}

struct cmd_context {
	uint8_t *uart_buf; // message payload (in/out)
	const struct command_desc *desc;
	uint32_t opcode;
	uint32_t status;
	uint32_t *args;
	uint8_t *data;
	uint32_t *resp_args;
	uint8_t *resp_data;
	uint32_t data_len;
	uint32_t resp_data_len;
};


static JCOMP_RV read_message(struct cmd_context *ctx, JCOMP_MSG in_msg) 
{
	size_t size = 0;
	uint16_t pos = 0; // position
	JCOMP_RV err = JCOMP_OK;

	_last_msg_noack = in_msg->type == JCOMP_MSG_TYPE_EVENT_NOACK;

	// Read opcode: state_read_opcode(ctx)
	//X serial_read_blocking((uint8_t *)&ctx->opcode, sizeof(ctx->opcode));
	err = jcomp_msg_get_bytes(in_msg, pos, 
		(uint8_t*)&ctx->opcode,
		sizeof(ctx->opcode), 
		&size);
	pos += size;

	if (err) {
		DBG_SEND(T_ERROR, "Failed to read opcode: %d", err);
		return err;
	}

	// Read args: state_read_args(ctx)
	const struct command_desc *desc = find_command_desc(ctx->opcode);
	if (!desc) {
		DBG_SEND(T_ERROR, "Failed to find cmd desc for opcode: %d", ctx->opcode);
		//X TODO: Error handler that can do args?
		ctx->status = RSP_ERR;
		return JCOMP_ERR_BOOTLOADER;
	}

	ctx->desc = desc;
	ctx->args = (uint32_t *)(ctx->uart_buf + sizeof(ctx->opcode));
	ctx->data = (uint8_t *)(ctx->args + desc->nargs);
	ctx->resp_args = ctx->args;
	ctx->resp_data = (uint8_t *)(ctx->resp_args + desc->resp_nargs);

	//X serial_read_blocking((uint8_t *)ctx->args, sizeof(*ctx->args) * desc->nargs);
	err = jcomp_msg_get_bytes(in_msg, pos,
		(uint8_t*)ctx->args, 
		sizeof(*ctx->args) * desc->nargs, 
		&size);
	pos += size;

	if (err) {
		DBG_SEND(T_ERROR, "Failed to read args: %d", err);
		return err;
	}

	// Read data: state_read_data(ctx)
	//X const struct command_desc *desc = ctx->desc;
	if (desc->size) {
		ctx->status = desc->size(ctx->args, &ctx->data_len, &ctx->resp_data_len);
		if (is_error(ctx->status)) {
			DBG_SEND(T_ERROR, "Failed to find data size, ctx->status: %d", ctx->status);
			return JCOMP_ERR_BOOTLOADER;
		}
	} else {
		ctx->data_len = 0;
		ctx->resp_data_len = 0;
	}

	//X TODO: Check sizes
	//X serial_read_blocking((uint8_t *)ctx->data, ctx->data_len);
	err = jcomp_msg_get_bytes(in_msg, pos,
		(uint8_t*)ctx->data, 
		ctx->data_len, 
		&size);
	pos += size;

	if (err) {
		DBG_SEND(T_ERROR, "Failed to read data: %d", err);
		return err;
	}

	return JCOMP_OK;
}

static JCOMP_RV send_msg_core(JCOMP_MSG resp, const uint8_t* payload, size_t len) {
	JCOMP_RV err = jcomp_msg_set_bytes(resp, 0, payload, len);
	if (err) {
		DBG_SEND(T_ERROR, "Failed to set response bytes: %d", err);
		return err;
	}
	err = jcomp_send_msg(resp);
	if (err) {
		DBG_SEND(T_ERROR, "Failed to send response: %d", err);
		return err;
	}
	return JCOMP_OK;
}
static JCOMP_RV send_response(uint8_t request_id, const uint8_t* payload, size_t len) {
	// Create either a response or a noack event (depending on the last message)
	uint8_t resp_buf[JCOMP_MSG_BUF_SIZE(len)];
	JCOMP_MSG resp = NULL;
	if (_last_msg_noack) {
		resp = jcomp_create_event_noack(len, resp_buf, sizeof(resp_buf));
	}
	else {
		resp = jcomp_create_response(request_id, len, resp_buf, sizeof(resp_buf));
	}

	if (!resp) {
		DBG_SEND(T_ERROR, "Failed to create response");
		return JCOMP_ERR_BOOTLOADER;
	}
	JCOMP_RV err = send_msg_core(resp, payload, len);
	return err;
}
static JCOMP_RV send_error(uint8_t request_id) {
	uint32_t data = RSP_ERR;
	return send_response(request_id, (uint8_t*)&data, sizeof(data));
}


static JCOMP_RV handle_data(struct cmd_context *ctx, uint8_t request_id)
{
	// Handle data: state_handle_data(ctx)
	const struct command_desc *desc = ctx->desc;

	if (desc->handle) {
		ctx->status = desc->handle(ctx->args, ctx->data, ctx->resp_args, ctx->resp_data);
		if (is_error(ctx->status)) {
			DBG_SEND(T_ERROR, "Failed to handle data, ctx->status: 0x%x", ctx->status);
			return JCOMP_ERR_BOOTLOADER;
		}
	} else {
		DBG_SEND(T_ERROR, "No handle function for opcode: 0x%x", ctx->opcode);
		ctx->status = RSP_OK;
	}

	size_t resp_len = sizeof(ctx->status) + (sizeof(*ctx->resp_args) * desc->resp_nargs) + ctx->resp_data_len;
	memcpy(ctx->uart_buf, &ctx->status, sizeof(ctx->status));
	
