kevinboenisch/rp2040-serial-bootloader/main.c
	// Special case, no response
	if (ctx->status == RSP_NO_RESP) {
		return JCOMP_OK;
	}

	// Send a response
	JCOMP_RV err = send_response(request_id, ctx->uart_buf, resp_len);
	return err;
}

static bool should_stay_in_bootloader()
{
	bool wd_says_so = (watchdog_hw->scratch[5] == BOOTLOADER_ENTRY_MAGIC) &&
		(watchdog_hw->scratch[6] == ~BOOTLOADER_ENTRY_MAGIC);

	return !gpio_get(BOOTLOADER_ENTRY_PIN) || wd_says_so;
}

void process_message(struct cmd_context *ctx, JCOMP_MSG in_msg) {
	JCOMP_RV err = read_message(ctx, in_msg);
	if (err) {
		DBG_SEND(T_ERROR, "Failed to read message rv: %d", err);
		send_error(jcomp_msg_id(in_msg));
		return;
	}
	err = handle_data(ctx, jcomp_msg_id(in_msg));
	if (err) {
		DBG_SEND(T_ERROR, "Failed to handle data rv: %d", err);
		send_error(jcomp_msg_id(in_msg));
		return;
	}
	// Done
}

void init_serial(void) {
    // USB
	// BUG FIX: delay mitigates the "Open (SetCommState): Unknown error code 31" bug,
	// which requires the user to physically reset the brain. 
	// It still happens, but with no delay it was happening after every soft (watchdog) reboot. 
	// see https://www.pivotaltracker.com/story/show/185554935
    // NOTE: use the same fix in the JPO bootloader

	// 100 ms is not enough.
    // 200 ms works most of the time, but is less reliable after BOOTSEL. 
	sleep_ms(400);
	stdio_init_all();
}

// in radio code see device_info.hpp
#define CMD_SET_JOY_REPORT_FAR  "fSETJOY-"
#define JOYC_OFF        "off-"
void disable_joystick_message_flood()
{
    uint8_t id = jcomp_get_next_cmd_id_bradio();
    JCOMP_CREATE_MSG(cmd_joy_on, JCOMP_MSG_TYPE_COMMAND_EVENT, id, 12);

    jcomp_msg_append_str(cmd_joy_on, CMD_SET_JOY_REPORT_FAR);
    jcomp_msg_append_str(cmd_joy_on, JOYC_OFF);
    jcomp_send_msg(cmd_joy_on);
    // What do do with the rv?
}

int main(void)
{
	// Binary size optimization (keep buffers in RAM to save flash space)
	// !! DO NOT MOVE/REFACTOR !! 
	// MUST BE IN main(), on top of the stack.
	alignas(4) uint8_t stored_flash_sector[FLASH_SECTOR_SIZE] = {0};
	core1_init_stored_flash_sector(stored_flash_sector);

	alignas(4) uint8_t write_flash_sector[FLASH_SECTOR_SIZE] = {0};
	_write_flash_sector = write_flash_sector;

#if OLED_ENABLED
	OLED_VTable_Obj oled_driver = {0};
#endif
#if OLED_INDICATORS_ENABLED
	OLED_VTable_Obj indicators_driver = {0};
#endif
	// End optimization


	gpio_init(BOOTLOADER_ENTRY_PIN);
	gpio_pull_up(BOOTLOADER_ENTRY_PIN);
	gpio_set_dir(BOOTLOADER_ENTRY_PIN, 0);

	sleep_ms(10);

	struct image_header *hdr = (struct image_header *)(XIP_BASE + IMAGE_HEADER_OFFSET);

	if (!should_stay_in_bootloader() && image_header_ok(hdr)) {
		uint32_t vtor = *((uint32_t *)(XIP_BASE + IMAGE_HEADER_OFFSET));
		disable_interrupts();
		reset_peripherals();
		jump_to_vtor(vtor);
	}

	init_serial();

#if OLED_ENABLED
	jcomp_core1_run_before_reboot_fn = oled_clear;
#endif

	jcomp_init();
	jcomp_set_env_type("BOOT:" VERSION_TIMESTAMP);

#if OLED_INDICATORS_ENABLED
	// Should be done before oled_init(), as the latter clears the screen and renders indicators 
	indicators_init(&indicators_driver);
#endif
#if OLED_ENABLED
	oled_init(&oled_driver);
#endif

	disable_joystick_message_flood();

	jcomp_add_core1_handler(core1_store_handler);

	struct cmd_context ctx;
	uint8_t uart_buf[(sizeof(uint32_t) * (1 + MAX_NARG)) + MAX_DATA_LEN];
	ctx.uart_buf = uart_buf;

	while (true) 
	{
		JCOMP_RECEIVE_MSG(in_msg, rv, 30000);
		if (rv == JCOMP_OK) {
			process_message(&ctx, in_msg);
		}
		else {
			// Error receiving. Not much we can do.
			// Timeout is ok, just wait again
		}
	}

	return 0;
}
